controllers/CategoryController.php

INSERT INTO `category` (`name`) VALUES ('Mascotas')
---
    public function actionCreate()
    {
        $model = new Category();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {