controllers/ProductController.php

    public function actionCreate()
    {
        $model = new Product();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `product` (`id_category`, `name`) VALUES (1, 'Queso')