controllers/ProductentryController.php

    public function actionCreate()
    {
        $model = new Productentry();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `product_entry` (`id_product`, `amount`) VALUES (1, 100)