models/Product.php

    public function findCategories()
    {
        $rows = (new \yii\db\Query())
        ->select(['category.id_category', 'category.name'])
        ->from('category')
        ->all();
---
SELECT `category`.`id_category`, `category`.`name` FROM `category`