models/Productentry.php

SELECT `product`.`id_product`, `product`.`name` FROM `product`
---
    public function findProducts()
    {
        $rows = (new \yii\db\Query())
        ->select(['product.id_product', 'product.name'])
        ->from('product')
        ->all();